*** crates/rcx-registry-skills/src/fetch.rs:111:25: delete field computed_hash from struct LockEntry expression in FetchOutcome::relock

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ delete field computed_hash from struct LockEntry expression in FetchOutcome::relock
@@ -103,17 +103,17 @@
         let skills = self
             .fetched
             .iter()
             .filter_map(|(name, f)| {
                 let prev = previous.skills.get(name)?;
                 Some((
                     name.clone(),
                     LockEntry {
-                        computed_hash: f.digest.clone(),
+                         /* ~ changed by cargo-mutants ~ */
                         git_ref: f.git_ref.clone(),
                         ..prev.clone()
                     },
                 ))
             })
             .collect();
         // Relocking always writes the current schema: the output carries whatever
         // refs the fetch used, so labelling it v1 would understate it. A relock of

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (32497) panicked at crates/rcx-registry-skills/src/fetch.rs:361:9:
assertion `left == right` failed
  left: "b94d27b9934d3e08a52e52d7da7dabfac484efe37a5380ee9088f7ace2efcde9"
 right: "fe32608c9ef5b6cf7e3f946480253ff76f24f4ec0678f3d0f07f9844cbff9601"

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
