*** crates/rcx-registry-skills/src/fetch.rs:135:5: replace raw_url -> String with String::new()

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace raw_url -> String with String::new()
@@ -127,25 +127,17 @@
 }
 
 /// Raw-content URL for a locked entry.
 ///
 /// Uses the pinned commit when the entry has one, which makes the URL immutable and
 /// the digest attributable. Falls back to `HEAD` only for v1 entries, which is
 /// exactly the ambiguity described above — those lockfiles cannot be signed.
 pub fn raw_url(entry: &LockEntry) -> String {
-    let reference = if entry.git_ref.is_empty() {
-        "HEAD"
-    } else {
-        &entry.git_ref
-    };
-    format!(
-        "https://raw.githubusercontent.com/{}/{reference}/{}",
-        entry.source, entry.skill_path
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve each distinct source to the commit its default branch currently points
 /// at, and stamp every entry with it.
 ///
 /// Resolution is per **source**, not per skill: 26 sources back 390 skills in the
 /// upstream lockfile, so this is 26 requests rather than 390, and it also guarantees
 /// that skills from one repo are pinned to one consistent commit rather than to

---- fetch::tests::raw_url_pins_the_commit_when_the_entry_has_one stdout ----

thread 'fetch::tests::raw_url_pins_the_commit_when_the_entry_has_one' (43148) panicked at crates/rcx-registry-skills/src/fetch.rs:468:9:
assertion `left == right` failed: a pinned entry must resolve to an immutable URL, never HEAD
  left: ""
 right: "https://raw.githubusercontent.com/trailofbits/skills/1111111111111111111111111111111111111111/s/SKILL.md"

---- fetch::tests::raw_url_falls_back_to_head_for_an_unpinned_entry stdout ----

thread 'fetch::tests::raw_url_falls_back_to_head_for_an_unpinned_entry' (43147) panicked at crates/rcx-registry-skills/src/fetch.rs:458:9:
assertion `left == right` failed
  left: ""
 right: "https://raw.githubusercontent.com/trailofbits/skills/HEAD/s/SKILL.md"

failures:
    fetch::tests::raw_url_falls_back_to_head_for_an_unpinned_entry
    fetch::tests::raw_url_pins_the_commit_when_the_entry_has_one

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
