*** crates/rcx-registry-skills/src/sign.rs:116:5: replace signing_preimage -> Vec<u8> with vec![1]

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace signing_preimage -> Vec<u8> with vec![1]
@@ -108,19 +108,17 @@
 /// the wrong one produces a signature that never verifies, with `BadSignature` as
 /// the only symptom for all three.
 ///
 /// Crown has no exported helper for this, so callers reconstruct it by knowing to
 /// call `to_canonical_cbor()` *before* populating the signature field. That ordering
 /// requirement is invisible at the call site and easy to get backwards. This function
 /// zeroes the field itself, so it is correct whatever the receipt currently holds.
 pub fn signing_preimage(receipt: &SkillSnapshotReceipt) -> Vec<u8> {
-    let mut unsigned = receipt.clone();
-    unsigned.receipt_signature = [0u8; 64];
-    unsigned.to_canonical_cbor()
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Sign `receipt` in place with a caller-supplied signer.
 ///
 /// The closure shape matches the server's Vault Transit signer, which never exposes
 /// a key — so this works for both a local test key and the production HSM path
 /// without either one reimplementing the preimage rule above.
 pub fn sign_receipt<E>(

---- the_signing_preimage_is_the_cbor_body_not_the_receipt_hash stdout ----

thread 'the_signing_preimage_is_the_cbor_body_not_the_receipt_hash' (79652) panicked at crates/rcx-registry-skills/tests/signing.rs:101:5:
the preimage is a CBOR document, not a digest

---- a_signed_lockfile_verifies stdout ----

thread 'a_signed_lockfile_verifies' (79642) panicked at crates/rcx-registry-skills/tests/signing.rs:72:10:
a correctly signed lockfile must verify: NotSignable { reason: "receipt signature did not verify: bad signature" }

---- a_wrong_skill_count_alone_is_rejected stdout ----

thread 'a_wrong_skill_count_alone_is_rejected' (79646) panicked at crates/rcx-registry-skills/tests/signing.rs:328:5:
got: lockfile is not signable: receipt signature did not verify: bad signature

failures:
    a_signed_lockfile_verifies
    a_validly_signed_receipt_for_another_lockfile_is_rejected
    a_wrong_lock_version_alone_is_rejected
    a_wrong_skill_count_alone_is_rejected
    the_signing_preimage_is_the_cbor_body_not_the_receipt_hash
    the_timestamp_never_reaches_the_merkle_root

test result: FAILED. 12 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
