*** crates/rcx-registry-skills/src/fetch.rs:222:24: replace || with && in parse_commit_sha

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace || with && in parse_commit_sha
@@ -214,17 +214,17 @@
 /// Split out of the request path so the guard is unit-testable — it is the only
 /// thing standing between a surprising API response and a lockfile pinned to
 /// garbage, and a network-gated test cannot exercise it.
 ///
 /// Normalises case on the way through: GitHub returns lowercase, but an uppercase
 /// id would otherwise reach `signable()` and be rejected far from its cause.
 fn parse_commit_sha(body: &str) -> Option<String> {
     let sha = body.trim();
-    if sha.len() != 40 || !sha.bytes().all(|b| b.is_ascii_hexdigit()) {
+    if sha.len() != 40 && /* ~ changed by cargo-mutants ~ */ !sha.bytes().all(|b| b.is_ascii_hexdigit()) {
         return None;
     }
     Some(sha.to_ascii_lowercase())
 }
 
 /// Check bytes against a pinned digest. Returns the digest actually computed on
 /// failure so the caller can report both sides.
 ///

---- fetch::tests::parse_commit_sha_rejects_anything_else stdout ----

thread 'fetch::tests::parse_commit_sha_rejects_anything_else' (49319) panicked at crates/rcx-registry-skills/src/fetch.rs:433:13:
assertion `left == right` failed: expected "" to be refused
  left: Some("")
 right: None

failures:
    fetch::tests::parse_commit_sha_rejects_anything_else

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
