*** crates/rcx-registry-skills/src/fetch.rs:234:5: replace verify_bytes -> Result<(), String> with Ok(())

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace verify_bytes -> Result<(), String> with Ok(())
@@ -226,22 +226,17 @@
 }
 
 /// Check bytes against a pinned digest. Returns the digest actually computed on
 /// failure so the caller can report both sides.
 ///
 /// Fails closed: any difference at all rejects, and the comparison is over the full
 /// 32-byte digest rather than a prefix.
 pub fn verify_bytes(bytes: &[u8], expected_hex: &str) -> Result<(), String> {
-    let actual = hex_digest(bytes);
-    if actual == expected_hex {
-        Ok(())
-    } else {
-        Err(actual)
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn hex_digest(bytes: &[u8]) -> String {
     let digest = Sha256::digest(bytes);
     let mut out = String::with_capacity(64);
     for byte in digest {
         use std::fmt::Write as _;
         let _ = write!(out, "{byte:02x}");

---- fetch::tests::corrupted_bytes_fail_closed stdout ----

thread 'fetch::tests::corrupted_bytes_fail_closed' (43583) panicked at crates/rcx-registry-skills/src/fetch.rs:316:55:
must reject: ()

---- fetch::tests::empty_content_does_not_verify_against_a_real_hash stdout ----

thread 'fetch::tests::empty_content_does_not_verify_against_a_real_hash' (43585) panicked at crates/rcx-registry-skills/src/fetch.rs:332:9:
assertion failed: verify_bytes(b"", HELLO).is_err()

---- fetch::tests::corrupted_digest_fails_closed stdout ----

thread 'fetch::tests::corrupted_digest_fails_closed' (43584) panicked at crates/rcx-registry-skills/src/fetch.rs:327:9:
assertion failed: verify_bytes(b"hello world", &tampered).is_err()

failures:
    fetch::tests::corrupted_bytes_fail_closed
    fetch::tests::corrupted_digest_fails_closed
    fetch::tests::empty_content_does_not_verify_against_a_real_hash

test result: FAILED. 20 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
