*** crates/rcx-registry-skills/src/fetch.rs:235:15: replace == with != in verify_bytes

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace == with != in verify_bytes
@@ -227,17 +227,17 @@
 
 /// Check bytes against a pinned digest. Returns the digest actually computed on
 /// failure so the caller can report both sides.
 ///
 /// Fails closed: any difference at all rejects, and the comparison is over the full
 /// 32-byte digest rather than a prefix.
 pub fn verify_bytes(bytes: &[u8], expected_hex: &str) -> Result<(), String> {
     let actual = hex_digest(bytes);
-    if actual == expected_hex {
+    if actual != /* ~ changed by cargo-mutants ~ */ expected_hex {
         Ok(())
     } else {
         Err(actual)
     }
 }
 
 fn hex_digest(bytes: &[u8]) -> String {
     let digest = Sha256::digest(bytes);

---- fetch::tests::empty_content_does_not_verify_against_a_real_hash stdout ----

thread 'fetch::tests::empty_content_does_not_verify_against_a_real_hash' (51747) panicked at crates/rcx-registry-skills/src/fetch.rs:337:9:
assertion failed: verify_bytes(b"", HELLO).is_err()

---- fetch::tests::corrupted_bytes_fail_closed stdout ----

thread 'fetch::tests::corrupted_bytes_fail_closed' (51745) panicked at crates/rcx-registry-skills/src/fetch.rs:321:55:
must reject: ()

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (51753) panicked at crates/rcx-registry-skills/src/fetch.rs:370:9:
assertion failed: verify_bytes(b"new content", &kept.computed_hash).is_ok()

failures:
    fetch::tests::corrupted_bytes_fail_closed
    fetch::tests::corrupted_digest_fails_closed
    fetch::tests::empty_content_does_not_verify_against_a_real_hash
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    fetch::tests::verifies_matching_bytes

test result: FAILED. 16 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
