*** crates/rcx-registry-skills/src/fetch.rs:78:9: replace FetchOutcome::verified -> impl Iterator<Item =(&String, &Fetched)> with ::std::iter::empty()

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace FetchOutcome::verified -> impl Iterator<Item =(&String, &Fetched)> with ::std::iter::empty()
@@ -70,17 +70,17 @@
 pub struct FetchOutcome {
     pub fetched: BTreeMap<String, Fetched>,
     pub mismatches: Vec<Mismatch>,
 }
 
 impl FetchOutcome {
     /// Entries whose bytes matched their pinned digest — the only trusted content.
     pub fn verified(&self) -> impl Iterator<Item = (&String, &Fetched)> {
-        self.fetched.iter().filter(|(_, f)| f.matched_lock)
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn verified_count(&self) -> usize {
         self.verified().count()
     }
 
     pub fn is_clean(&self) -> bool {
         self.mismatches.is_empty()

---- fetch::tests::verified_count_counts_only_matching_entries stdout ----

thread 'fetch::tests::verified_count_counts_only_matching_entries' (20496) panicked at crates/rcx-registry-skills/src/fetch.rs:456:9:
assertion `left == right` failed: unmatched bytes are never counted as verified
  left: 0
 right: 2

failures:
    fetch::tests::verified_count_counts_only_matching_entries

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
