*** crates/rcx-registry-skills/src/fetch.rs:86:9: replace FetchOutcome::is_clean -> bool with true

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace FetchOutcome::is_clean -> bool with true
@@ -78,17 +78,17 @@
         self.fetched.iter().filter(|(_, f)| f.matched_lock)
     }
 
     pub fn verified_count(&self) -> usize {
         self.verified().count()
     }
 
     pub fn is_clean(&self) -> bool {
-        self.mismatches.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Rebuild a lockfile from what was actually fetched, pinning the digests
     /// observed rather than the ones inherited.
     ///
     /// This exists because an inherited lockfile can be unverifiable — the upstream
     /// `skills-lock.json` verified 0 of 390 on first run, its hashes produced by a
     /// process absent from that repo. Signing such a file attests nothing. Relocking

---- fetch::tests::is_clean_tracks_mismatches stdout ----

thread 'fetch::tests::is_clean_tracks_mismatches' (90221) panicked at crates/rcx-registry-skills/src/fetch.rs:472:9:
any mismatch means not clean

failures:
    fetch::tests::is_clean_tracks_mismatches

test result: FAILED. 26 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
