*** crates/rcx-registry-skills/src/index.rs:71:5: replace tags_of -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/rcx-registry-skills/src/index.rs
+++ replace tags_of -> Vec<String> with vec!["xyzzy".into()]
@@ -63,27 +63,17 @@
     }
     text
 }
 
 /// Tags from `metadata.tags`, which is where the Agent Skills corpora in the wild
 /// put them. Absent or malformed metadata yields none rather than an error — a
 /// skill without tags is still perfectly indexable.
 fn tags_of(doc: &SkillDocument) -> Vec<String> {
-    doc.front_matter
-        .extra
-        .get("metadata")
-        .and_then(|m| m.get("tags"))
-        .and_then(|t| t.as_sequence())
-        .map(|seq| {
-            seq.iter()
-                .filter_map(|v| v.as_str().map(str::to_string))
-                .collect()
-        })
-        .unwrap_or_default()
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build an ingest payload for a set of `(skill_id, document, uri)` triples.
 ///
 /// One chunk per skill: the indexed surface is a couple of hundred characters, so
 /// splitting it would only dilute the term statistics that make BM25 work.
 pub fn ingest_body(
     tenant_id: &str,

---- index::tests::a_skill_without_tags_still_indexes stdout ----

thread 'index::tests::a_skill_without_tags_still_indexes' (21137) panicked at crates/rcx-registry-skills/src/index.rs:149:9:
assertion `left == right` failed
  left: "n\nd xyzzy"
 right: "n\nd"

failures:
    index::tests::a_skill_without_tags_still_indexes

test result: FAILED. 26 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
