*** crates/rcx-registry-skills/src/lock.rs:135:9: replace SkillLock::len -> usize with 1

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace SkillLock::len -> usize with 1
@@ -127,17 +127,17 @@
                     ),
                 });
             }
         }
         Ok(())
     }
 
     pub fn len(&self) -> usize {
-        self.skills.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.skills.is_empty()
     }
 }
 
 /// 64 lowercase hex characters. Uppercase is rejected rather than normalised — two

---- lock::tests::len_and_is_empty_agree stdout ----

thread 'lock::tests::len_and_is_empty_agree' (33238) panicked at crates/rcx-registry-skills/src/lock.rs:233:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    lock::tests::len_and_is_empty_agree

test result: FAILED. 26 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
