*** crates/rcx-registry-skills/src/lock.rs:139:9: replace SkillLock::is_empty -> bool with false

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace SkillLock::is_empty -> bool with false
@@ -131,17 +131,17 @@
         Ok(())
     }
 
     pub fn len(&self) -> usize {
         self.skills.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.skills.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// 64 lowercase hex characters. Uppercase is rejected rather than normalised — two
 /// spellings of one digest would give the signed snapshot two valid forms.
 fn is_sha256_hex(s: &str) -> bool {
     is_lower_hex(s, 64)
 }

*** result: Success
