*** crates/rcx-registry-skills/src/lock.rs:146:5: replace is_sha256_hex -> bool with false

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace is_sha256_hex -> bool with false
@@ -138,17 +138,17 @@
     pub fn is_empty(&self) -> bool {
         self.skills.is_empty()
     }
 }
 
 /// 64 lowercase hex characters. Uppercase is rejected rather than normalised — two
 /// spellings of one digest would give the signed snapshot two valid forms.
 fn is_sha256_hex(s: &str) -> bool {
-    is_lower_hex(s, 64)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// A full git object id: 40 lowercase hex characters. Abbreviated ids are rejected
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
     is_lower_hex(s, 40)
 }

---- lock::tests::rejects_unsupported_source_type stdout ----

thread 'lock::tests::rejects_unsupported_source_type' (65920) panicked at crates/rcx-registry-skills/src/lock.rs:236:9:
assertion failed: matches!(lock.validate(), Err(SkillsError::UnsupportedSource { .. }))

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (65915) panicked at crates/rcx-registry-skills/src/fetch.rs:369:9:
assertion failed: relocked.validate().is_ok()

---- lock::tests::round_trip_is_byte_exact stdout ----

thread 'lock::tests::round_trip_is_byte_exact' (65921) panicked at crates/rcx-registry-skills/src/lock.rs:182:47:
parses: BadHash { name: "ab-testing", got: "4ea04d576507f4a683e6203737c33993fb36add719f628b7200649a9cb87b5fe" }

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    lock::tests::rejects_unsupported_source_type
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
