*** crates/rcx-registry-skills/src/lock.rs:156:5: replace is_lower_hex -> bool with false

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace is_lower_hex -> bool with false
@@ -148,19 +148,17 @@
 
 /// A full git object id: 40 lowercase hex characters. Abbreviated ids are rejected
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
     is_lower_hex(s, 40)
 }
 
 fn is_lower_hex(s: &str, len: usize) -> bool {
-    s.len() == len
-        && s.bytes()
-            .all(|b| b.is_ascii_digit() || (b'a'..=b'f').contains(&b))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn entry(hash: &str) -> LockEntry {
         LockEntry {

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (68392) panicked at crates/rcx-registry-skills/src/fetch.rs:369:9:
assertion failed: relocked.validate().is_ok()

---- lock::tests::rejects_unsupported_source_type stdout ----

thread 'lock::tests::rejects_unsupported_source_type' (68397) panicked at crates/rcx-registry-skills/src/lock.rs:234:9:
assertion failed: matches!(lock.validate(), Err(SkillsError::UnsupportedSource { .. }))

---- lock::tests::round_trip_is_byte_exact stdout ----

thread 'lock::tests::round_trip_is_byte_exact' (68398) panicked at crates/rcx-registry-skills/src/lock.rs:180:47:
parses: BadHash { name: "ab-testing", got: "4ea04d576507f4a683e6203737c33993fb36add719f628b7200649a9cb87b5fe" }

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    lock::tests::rejects_unsupported_source_type
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
