*** crates/rcx-registry-skills/src/lock.rs:157:9: replace && with || in is_lower_hex

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace && with || in is_lower_hex
@@ -149,17 +149,17 @@
 /// A full git object id: 40 lowercase hex characters. Abbreviated ids are rejected
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
     is_lower_hex(s, 40)
 }
 
 fn is_lower_hex(s: &str, len: usize) -> bool {
     s.len() == len
-        && s.bytes()
+        || /* ~ changed by cargo-mutants ~ */ s.bytes()
             .all(|b| b.is_ascii_digit() || (b'a'..=b'f').contains(&b))
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn entry(hash: &str) -> LockEntry {

---- fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable stdout ----

thread 'fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable' (68995) panicked at crates/rcx-registry-skills/src/fetch.rs:395:9:
a version bump alone must never make a refless lockfile signable

---- lock::tests::rejects_malformed_hashes stdout ----

thread 'lock::tests::rejects_malformed_hashes' (68998) panicked at crates/rcx-registry-skills/src/lock.rs:219:13:
expected "" to be rejected

failures:
    fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable
    lock::tests::rejects_malformed_hashes

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
