*** crates/rcx-registry-skills/src/lock.rs:84:16: delete ! in SkillLock::validate

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ delete ! in SkillLock::validate
@@ -76,17 +76,17 @@
     pub fn to_json(&self) -> Result<String, SkillsError> {
         let mut out = serde_json::to_string_pretty(self)?;
         out.push('\n');
         Ok(out)
     }
 
     pub fn validate(&self) -> Result<(), SkillsError> {
         for (name, entry) in &self.skills {
-            if !is_sha256_hex(&entry.computed_hash) {
+            if  /* ~ changed by cargo-mutants ~ */is_sha256_hex(&entry.computed_hash) {
                 return Err(SkillsError::BadHash {
                     name: name.clone(),
                     got: entry.computed_hash.clone(),
                 });
             }
             if entry.source_type != "github" {
                 return Err(SkillsError::UnsupportedSource {
                     name: name.clone(),

---- lock::tests::rejects_malformed_hashes stdout ----

thread 'lock::tests::rejects_malformed_hashes' (58528) panicked at crates/rcx-registry-skills/src/lock.rs:219:13:
expected "" to be rejected

---- lock::tests::rejects_unsupported_source_type stdout ----

thread 'lock::tests::rejects_unsupported_source_type' (58529) panicked at crates/rcx-registry-skills/src/lock.rs:236:9:
assertion failed: matches!(lock.validate(), Err(SkillsError::UnsupportedSource { .. }))

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (58524) panicked at crates/rcx-registry-skills/src/fetch.rs:369:9:
assertion failed: relocked.validate().is_ok()

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    lock::tests::rejects_malformed_hashes
    lock::tests::rejects_unsupported_source_type
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 17 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
