*** crates/rcx-registry-skills/src/lock.rs:90:34: replace != with == in SkillLock::validate

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace != with == in SkillLock::validate
@@ -82,17 +82,17 @@
     pub fn validate(&self) -> Result<(), SkillsError> {
         for (name, entry) in &self.skills {
             if !is_sha256_hex(&entry.computed_hash) {
                 return Err(SkillsError::BadHash {
                     name: name.clone(),
                     got: entry.computed_hash.clone(),
                 });
             }
-            if entry.source_type != "github" {
+            if entry.source_type == /* ~ changed by cargo-mutants ~ */ "github" {
                 return Err(SkillsError::UnsupportedSource {
                     name: name.clone(),
                     source_type: entry.source_type.clone(),
                 });
             }
         }
         Ok(())
     }

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (26188) panicked at crates/rcx-registry-skills/src/fetch.rs:369:9:
assertion failed: relocked.validate().is_ok()

---- lock::tests::rejects_unsupported_source_type stdout ----

thread 'lock::tests::rejects_unsupported_source_type' (26199) panicked at crates/rcx-registry-skills/src/lock.rs:255:9:
assertion failed: matches!(lock.validate(), Err(SkillsError::UnsupportedSource { .. }))

---- lock::tests::round_trip_is_byte_exact stdout ----

thread 'lock::tests::round_trip_is_byte_exact' (26200) panicked at crates/rcx-registry-skills/src/lock.rs:182:47:
parses: UnsupportedSource { name: "ab-testing", source_type: "github" }

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    lock::tests::rejects_unsupported_source_type
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 24 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
