*** crates/rcx-registry-skills/src/sign.rs:133:5: replace sign_receipt -> Result<(), E> with Ok(())

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace sign_receipt -> Result<(), E> with Ok(())
@@ -125,19 +125,17 @@
 /// without either one reimplementing the preimage rule above.
 pub fn sign_receipt<E>(
     receipt: &mut SkillSnapshotReceipt,
     sign: impl FnOnce(&[u8]) -> Result<[u8; 64], E>,
 ) -> Result<(), E> {
     // Recompute rather than trust: a caller who mutated the body after
     // `prepare_receipt` would otherwise sign a preimage that disagrees with the
     // stored hash, and fail verification at the hash check with no clue why.
-    receipt.receipt_hash = receipt.compute_hash();
-    receipt.receipt_signature = sign(&signing_preimage(receipt))?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check a receipt against a lockfile and a public key.
 ///
 /// Both halves are required and neither implies the other: the signature proves the
 /// receipt came from the signer, and the root comparison proves the receipt is about
 /// *this* lockfile. Verifying only the signature would accept a validly signed
 /// receipt for a different set of skills — the substitution a lockfile signature

---- a_wrong_lock_version_alone_is_rejected stdout ----

thread 'a_wrong_lock_version_alone_is_rejected' (80415) panicked at crates/rcx-registry-skills/tests/signing.rs:344:5:
got: lockfile is not signable: receipt signature did not verify: bad signature

---- a_signed_lockfile_verifies stdout ----

thread 'a_signed_lockfile_verifies' (80412) panicked at crates/rcx-registry-skills/tests/signing.rs:72:10:
a correctly signed lockfile must verify: NotSignable { reason: "receipt signature did not verify: bad signature" }

---- a_validly_signed_receipt_for_another_lockfile_is_rejected stdout ----

thread 'a_validly_signed_receipt_for_another_lockfile_is_rejected' (80414) panicked at crates/rcx-registry-skills/tests/signing.rs:302:5:
unexpected rejection reason: lockfile is not signable: receipt signature did not verify: bad signature

failures:
    a_signed_lockfile_verifies
    a_validly_signed_receipt_for_another_lockfile_is_rejected
    a_wrong_lock_version_alone_is_rejected
    a_wrong_skill_count_alone_is_rejected
    the_timestamp_never_reaches_the_merkle_root

test result: FAILED. 13 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
