*** crates/rcx-registry-skills/src/sign.rs:150:5: replace verify_lock_receipt -> Result<(), SkillsError> with Ok(())

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace verify_lock_receipt -> Result<(), SkillsError> with Ok(())
@@ -142,45 +142,10 @@
 /// *this* lockfile. Verifying only the signature would accept a validly signed
 /// receipt for a different set of skills — the substitution a lockfile signature
 /// exists to prevent.
 pub fn verify_lock_receipt(
     lock: &SkillLock,
     receipt: &SkillSnapshotReceipt,
     public_key: &[u8],
 ) -> Result<(), SkillsError> {
-    verify_receipt_signature(receipt, public_key).map_err(|error: CrownError| {
-        SkillsError::NotSignable {
-            reason: format!("receipt signature did not verify: {error}"),
-        }
-    })?;
-
-    let recomputed = lock_merkle_root(lock)?;
-    if recomputed != receipt.lock_merkle_root {
-        return Err(SkillsError::NotSignable {
-            reason: "receipt is validly signed but its Merkle root does not match this lockfile"
-                .to_string(),
-        });
-    }
-
-    // Split rather than `||`-joined: a combined condition is satisfied by either
-    // half, so a test that trips both at once never proves the other is checked.
-    // `cargo-mutants` flagged exactly that — flipping the `||` to `&&` survived the
-    // whole suite, because every case that changed the count also changed the root.
-    if u64::from(lock.version) != receipt.lock_version {
-        return Err(SkillsError::NotSignable {
-            reason: format!(
-                "receipt describes lock version {} but this lockfile is version {}",
-                receipt.lock_version, lock.version
-            ),
-        });
-    }
-    if lock.len() as u64 != receipt.skill_count {
-        return Err(SkillsError::NotSignable {
-            reason: format!(
-                "receipt describes {} skills but this lockfile has {}",
-                receipt.skill_count,
-                lock.len()
-            ),
-        });
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- a_mutated_receipt_body_is_rejected stdout ----

thread 'a_mutated_receipt_body_is_rejected' (81208) panicked at crates/rcx-registry-skills/tests/signing.rs:364:5:
assertion failed: verify_lock_receipt(&lock, &receipt, &key.verifying_key().to_bytes()).is_err()

---- a_receipt_signed_by_the_wrong_key_is_rejected stdout ----

thread 'a_receipt_signed_by_the_wrong_key_is_rejected' (81209) panicked at crates/rcx-registry-skills/tests/signing.rs:354:5:
assertion failed: verify_lock_receipt(&lock, &receipt,
        &real.verifying_key().to_bytes()).is_err()

---- a_flipped_content_hash_fails_verification stdout ----

thread 'a_flipped_content_hash_fails_verification' (81207) panicked at crates/rcx-registry-skills/tests/signing.rs:280:5:
a single flipped byte in any computedHash must fail verification

failures:
    a_back_dated_timestamp_breaks_the_signature
    a_flipped_content_hash_fails_verification
    a_mutated_receipt_body_is_rejected
    a_receipt_signed_by_the_wrong_key_is_rejected
    a_validly_signed_receipt_for_another_lockfile_is_rejected
    a_wrong_lock_version_alone_is_rejected
    a_wrong_skill_count_alone_is_rejected

test result: FAILED. 11 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
