*** crates/rcx-registry-skills/src/sign.rs:157:19: replace != with == in verify_lock_receipt

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace != with == in verify_lock_receipt
@@ -149,17 +149,17 @@
 ) -> Result<(), SkillsError> {
     verify_receipt_signature(receipt, public_key).map_err(|error: CrownError| {
         SkillsError::NotSignable {
             reason: format!("receipt signature did not verify: {error}"),
         }
     })?;
 
     let recomputed = lock_merkle_root(lock)?;
-    if recomputed != receipt.lock_merkle_root {
+    if recomputed == /* ~ changed by cargo-mutants ~ */ receipt.lock_merkle_root {
         return Err(SkillsError::NotSignable {
             reason: "receipt is validly signed but its Merkle root does not match this lockfile"
                 .to_string(),
         });
     }
 
     // Split rather than `||`-joined: a combined condition is satisfied by either
     // half, so a test that trips both at once never proves the other is checked.

---- a_wrong_skill_count_alone_is_rejected stdout ----

thread 'a_wrong_skill_count_alone_is_rejected' (81991) panicked at crates/rcx-registry-skills/tests/signing.rs:328:5:
got: lockfile is not signable: receipt is validly signed but its Merkle root does not match this lockfile

---- a_flipped_content_hash_fails_verification stdout ----

thread 'a_flipped_content_hash_fails_verification' (81983) panicked at crates/rcx-registry-skills/tests/signing.rs:280:5:
a single flipped byte in any computedHash must fail verification

---- a_signed_lockfile_verifies stdout ----

thread 'a_signed_lockfile_verifies' (81987) panicked at crates/rcx-registry-skills/tests/signing.rs:72:10:
a correctly signed lockfile must verify: NotSignable { reason: "receipt is validly signed but its Merkle root does not match this lockfile" }

failures:
    a_flipped_content_hash_fails_verification
    a_signed_lockfile_verifies
    a_validly_signed_receipt_for_another_lockfile_is_rejected
    a_wrong_lock_version_alone_is_rejected
    a_wrong_skill_count_alone_is_rejected
    the_timestamp_never_reaches_the_merkle_root

test result: FAILED. 12 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
