*** crates/rcx-registry-skills/src/sign.rs:168:32: replace != with == in verify_lock_receipt

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace != with == in verify_lock_receipt
@@ -160,17 +160,17 @@
                 .to_string(),
         });
     }
 
     // Split rather than `||`-joined: a combined condition is satisfied by either
     // half, so a test that trips both at once never proves the other is checked.
     // `cargo-mutants` flagged exactly that — flipping the `||` to `&&` survived the
     // whole suite, because every case that changed the count also changed the root.
-    if u64::from(lock.version) != receipt.lock_version {
+    if u64::from(lock.version) == /* ~ changed by cargo-mutants ~ */ receipt.lock_version {
         return Err(SkillsError::NotSignable {
             reason: format!(
                 "receipt describes lock version {} but this lockfile is version {}",
                 receipt.lock_version, lock.version
             ),
         });
     }
     if lock.len() as u64 != receipt.skill_count {

---- a_wrong_skill_count_alone_is_rejected stdout ----

thread 'a_wrong_skill_count_alone_is_rejected' (51915) panicked at crates/rcx-registry-skills/tests/signing.rs:328:5:
got: lockfile is not signable: receipt describes lock version 2 but this lockfile is version 2

---- a_wrong_lock_version_alone_is_rejected stdout ----

thread 'a_wrong_lock_version_alone_is_rejected' (51914) panicked at crates/rcx-registry-skills/tests/signing.rs:343:10:
a re-signed receipt for another lock version must be rejected: ()

---- the_timestamp_never_reaches_the_merkle_root stdout ----

thread 'the_timestamp_never_reaches_the_merkle_root' (51922) panicked at crates/rcx-registry-skills/tests/signing.rs:184:14:
a timestamped receipt must still verify: NotSignable { reason: "receipt describes lock version 2 but this lockfile is version 2" }

failures:
    a_signed_lockfile_verifies
    a_wrong_lock_version_alone_is_rejected
    a_wrong_skill_count_alone_is_rejected
    the_timestamp_never_reaches_the_merkle_root

test result: FAILED. 14 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
