*** crates/rcx-registry-skills/src/sign.rs:176:26: replace != with == in verify_lock_receipt

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace != with == in verify_lock_receipt
@@ -168,17 +168,17 @@
     if u64::from(lock.version) != receipt.lock_version {
         return Err(SkillsError::NotSignable {
             reason: format!(
                 "receipt describes lock version {} but this lockfile is version {}",
                 receipt.lock_version, lock.version
             ),
         });
     }
-    if lock.len() as u64 != receipt.skill_count {
+    if lock.len() as u64 == /* ~ changed by cargo-mutants ~ */ receipt.skill_count {
         return Err(SkillsError::NotSignable {
             reason: format!(
                 "receipt describes {} skills but this lockfile has {}",
                 receipt.skill_count,
                 lock.len()
             ),
         });
     }

---- a_wrong_skill_count_alone_is_rejected stdout ----

thread 'a_wrong_skill_count_alone_is_rejected' (52761) panicked at crates/rcx-registry-skills/tests/signing.rs:327:10:
a re-signed receipt with the wrong count must still be rejected: ()

---- a_signed_lockfile_verifies stdout ----

thread 'a_signed_lockfile_verifies' (52757) panicked at crates/rcx-registry-skills/tests/signing.rs:72:10:
a correctly signed lockfile must verify: NotSignable { reason: "receipt describes 2 skills but this lockfile has 2" }

---- the_timestamp_never_reaches_the_merkle_root stdout ----

thread 'the_timestamp_never_reaches_the_merkle_root' (52768) panicked at crates/rcx-registry-skills/tests/signing.rs:184:14:
a timestamped receipt must still verify: NotSignable { reason: "receipt describes 2 skills but this lockfile has 2" }

failures:
    a_signed_lockfile_verifies
    a_wrong_skill_count_alone_is_rejected
    the_timestamp_never_reaches_the_merkle_root

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
