*** crates/rcx-registry-skills/src/sign.rs:36:5: replace digest_entries -> Vec<SnapshotEntry> with vec![]

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace digest_entries -> Vec<SnapshotEntry> with vec![]
@@ -28,33 +28,17 @@
 
 /// Project a lockfile onto the digest entries the Merkle root is taken over.
 ///
 /// `version` in the digest is the **commit ref**, not a semver: it is what makes
 /// two lockings of the same skill at different commits distinct leaves. Entries are
 /// framed and sorted inside `snapshot_merkle_root`, so map iteration order here
 /// cannot affect the root.
 pub fn digest_entries(lock: &SkillLock) -> Vec<SnapshotEntry> {
-    lock.skills
-        .iter()
-        .map(|(name, entry)| {
-            // Every field that identifies the content enters the digest. `source`
-            // and `skillPath` are included because the same bytes fetched from a
-            // different repo is a different provenance claim, and the root must
-            // move when provenance moves.
-            let canonical = canonicalize_json(&json!({
-                "source": entry.source,
-                "sourceType": entry.source_type,
-                "skillPath": entry.skill_path,
-                "ref": entry.git_ref,
-                "computedHash": entry.computed_hash,
-            }));
-            SnapshotEntry::new(name.clone(), entry.git_ref.clone(), canonical)
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Merkle root over a lockfile.
 ///
 /// Refuses unsignable lockfiles rather than returning a root nobody should use —
 /// a root is only meaningful if the entries under it can be re-derived.
 pub fn lock_merkle_root(lock: &SkillLock) -> Result<[u8; HASH_LEN], SkillsError> {
     lock.signable()?;

---- every_identifying_field_changes_the_root stdout ----

thread 'every_identifying_field_changes_the_root' (43910) panicked at crates/rcx-registry-skills/tests/signing.rs:250:9:
assertion `left != right` failed: changing source must move the Merkle root
  left: [175, 19, 73, 185, 245, 249, 161, 166, 160, 64, 77, 234, 54, 220, 201, 73, 155, 203, 37, 201, 173, 193, 18, 183, 204, 154, 147, 202, 228, 31, 50, 98]
 right: [175, 19, 73, 185, 245, 249, 161, 166, 160, 64, 77, 234, 54, 220, 201, 73, 155, 203, 37, 201, 173, 193, 18, 183, 204, 154, 147, 202, 228, 31, 50, 98]

---- a_validly_signed_receipt_for_another_lockfile_is_rejected stdout ----

thread 'a_validly_signed_receipt_for_another_lockfile_is_rejected' (43897) panicked at crates/rcx-registry-skills/tests/signing.rs:302:5:
unexpected rejection reason: lockfile is not signable: receipt describes 2 skills but this lockfile has 3

---- a_flipped_content_hash_fails_verification stdout ----

thread 'a_flipped_content_hash_fails_verification' (43891) panicked at crates/rcx-registry-skills/tests/signing.rs:280:5:
a single flipped byte in any computedHash must fail verification

failures:
    a_flipped_content_hash_fails_verification
    a_validly_signed_receipt_for_another_lockfile_is_rejected
    every_identifying_field_changes_the_root

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
