*** crates/rcx-registry-skills/src/skill.rs:84:5: replace split_at_closing_fence -> Option<(&str, &str)> with None

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace split_at_closing_fence -> Option<(&str, &str)> with None
@@ -76,24 +76,17 @@
             Some((byte_idx, _)) => &d[..byte_idx],
             None => d,
         }
     }
 }
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
-    let mut offset = 0usize;
-    for line in rest.split_inclusive('\n') {
-        if line.trim_end_matches('\n') == FENCE {
-            return Some((&rest[..offset], &rest[offset + line.len()..]));
-        }
-        offset += line.len();
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const DOC: &str = "---\nname: ab-testing\ndescription: \"Run an A/B test: design, size, read out.\"\nversion: \"1.2\"\ntags:\n  - growth\n---\n\n# A/B testing\n\nBody here.\n";

---- index::tests::ingest_body_shapes_one_chunk_per_skill stdout ----

thread 'index::tests::ingest_body_shapes_one_chunk_per_skill' (55533) panicked at crates/rcx-registry-skills/src/index.rs:126:35:
parses: MalformedFrontMatter

---- skill::tests::accepts_bom_and_crlf stdout ----

thread 'skill::tests::accepts_bom_and_crlf' (55539) panicked at crates/rcx-registry-skills/src/skill.rs:114:48:
parses: MalformedFrontMatter

---- skill::tests::frontmatter_ending_at_eof_still_parses stdout ----

thread 'skill::tests::frontmatter_ending_at_eof_still_parses' (55541) panicked at crates/rcx-registry-skills/src/skill.rs:120:75:
parses: MalformedFrontMatter

failures:
    index::tests::a_skill_without_tags_still_indexes
    index::tests::body_is_never_indexed
    index::tests::indexed_text_carries_name_description_and_tags
    index::tests::ingest_body_shapes_one_chunk_per_skill
    skill::tests::accepts_bom_and_crlf
    skill::tests::discovery_description_truncates_on_char_boundaries
    skill::tests::frontmatter_ending_at_eof_still_parses
    skill::tests::parses_frontmatter_and_body
    skill::tests::preserves_unmodelled_keys

test result: FAILED. 18 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
