*** crates/rcx-registry-skills/src/skill.rs:89:16: replace += with *= in split_at_closing_fence

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace += with *= in split_at_closing_fence
@@ -81,17 +81,17 @@
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
     let mut offset = 0usize;
     for line in rest.split_inclusive('\n') {
         if line.trim_end_matches('\n') == FENCE {
             return Some((&rest[..offset], &rest[offset + line.len()..]));
         }
-        offset += line.len();
+        offset *= /* ~ changed by cargo-mutants ~ */ line.len();
     }
     None
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- index::tests::ingest_body_shapes_one_chunk_per_skill stdout ----

thread 'index::tests::ingest_body_shapes_one_chunk_per_skill' (67412) panicked at crates/rcx-registry-skills/src/index.rs:126:35:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

---- index::tests::body_is_never_indexed stdout ----

thread 'index::tests::body_is_never_indexed' (67410) panicked at crates/rcx-registry-skills/src/index.rs:126:35:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

---- index::tests::a_skill_without_tags_still_indexes stdout ----

thread 'index::tests::a_skill_without_tags_still_indexes' (67409) panicked at crates/rcx-registry-skills/src/index.rs:158:79:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

failures:
    index::tests::a_skill_without_tags_still_indexes
    index::tests::body_is_never_indexed
    index::tests::indexed_text_carries_name_description_and_tags
    index::tests::ingest_body_shapes_one_chunk_per_skill
    skill::tests::accepts_bom_and_crlf
    skill::tests::discovery_description_truncates_on_char_boundaries
    skill::tests::frontmatter_ending_at_eof_still_parses
    skill::tests::parses_frontmatter_and_body
    skill::tests::preserves_unmodelled_keys

test result: FAILED. 18 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
