*** crates/rcx-registry-skills/src/uri.rs:126:13: delete field version from struct Self expression in SkillUri::pinned_to

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ delete field version from struct Self expression in SkillUri::pinned_to
@@ -118,17 +118,17 @@
     /// True when this URI names an immutable object.
     pub fn is_pinned(&self) -> bool {
         self.version.is_some()
     }
 
     /// Pin an unpinned URI to a commit.
     pub fn pinned_to(&self, commit: &str) -> Self {
         Self {
-            version: Some(commit.to_ascii_lowercase()),
+             /* ~ changed by cargo-mutants ~ */
             ..self.clone()
         }
     }
 }
 
 impl fmt::Display for SkillUri {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{SCHEME}{}/{}", self.registry, self.skill_id)?;

---- an_unpinned_uri_round_trips stdout ----

thread 'an_unpinned_uri_round_trips' (79104) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:63:5:
assertion `left == right` failed
  left: "skill://registry.rcxprotocol.org/ab-testing"
 right: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678"

failures:
    an_unpinned_uri_round_trips

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
