*** crates/rcx-registry-skills/src/uri.rs:191:54: replace == with != in resolve

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace == with != in resolve
@@ -183,17 +183,17 @@
 /// The URI names its registry, so precedence does not apply — only the named
 /// registry may answer. Anything else would let a higher-precedence registry
 /// substitute content for a URI that explicitly asked elsewhere, which is the
 /// substitution attack the scheme exists to prevent.
 ///
 /// A pinned URI additionally requires the entry's commit to match. A registry that
 /// holds the skill at a *different* commit is not a match — it is a different object.
 pub fn resolve<'a>(uri: &SkillUri, registries: &'a [Registry]) -> Option<Resolved<'a>> {
-    let registry = registries.iter().find(|r| r.host == uri.registry)?;
+    let registry = registries.iter().find(|r| r.host != /* ~ changed by cargo-mutants ~ */ uri.registry)?;
     let entry = registry.lock.skills.get(&uri.skill_id)?;
     if let Some(version) = &uri.version {
         if &entry.git_ref != version {
             return None;
         }
     }
     Some(Resolved {
         uri: uri.clone(),

---- a_named_registry_cannot_be_substituted_by_a_higher_precedence_one stdout ----

thread 'a_named_registry_cannot_be_substituted_by_a_higher_precedence_one' (10452) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:173:5:
assertion `left == right` failed
  left: "local.example"
 right: "remote.example"

---- a_pinned_uri_resolves_to_exactly_one_object stdout ----

thread 'a_pinned_uri_resolves_to_exactly_one_object' (10453) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:137:45:
resolves

failures:
    a_named_registry_cannot_be_substituted_by_a_higher_precedence_one
    a_pinned_uri_resolves_to_exactly_one_object

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
