*** crates/rcx-registry-skills/src/uri.rs:194:5: replace resolve -> Option<Resolved<'a>> with None

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace resolve -> Option<Resolved<'a>> with None
@@ -186,29 +186,17 @@
 /// The URI names its registry, so precedence does not apply — only the named
 /// registry may answer. Anything else would let a higher-precedence registry
 /// substitute content for a URI that explicitly asked elsewhere, which is the
 /// substitution attack the scheme exists to prevent.
 ///
 /// A pinned URI additionally requires the entry's commit to match. A registry that
 /// holds the skill at a *different* commit is not a match — it is a different object.
 pub fn resolve<'a>(uri: &SkillUri, registries: &'a [Registry]) -> Option<Resolved<'a>> {
-    let registry = registries.iter().find(|r| r.host == uri.registry)?;
-    let entry = registry.lock.skills.get(&uri.skill_id)?;
-    if let Some(version) = &uri.version {
-        if &entry.git_ref != version {
-            return None;
-        }
-    }
-    Some(Resolved {
-        uri: uri.clone(),
-        registry: &registry.host,
-        kind: registry.kind,
-        entry,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve a bare skill id with no registry named, honouring precedence.
 ///
 /// This is the search path — `skills_find_relevant` rather than a URI lookup — and
 /// it is where [`resolution_order`] matters.
 pub fn resolve_by_id<'a>(skill_id: &str, registries: &'a [Registry]) -> Option<Resolved<'a>> {
     for registry in resolution_order(registries) {

---- a_named_registry_cannot_be_substituted_by_a_higher_precedence_one stdout ----

thread 'a_named_registry_cannot_be_substituted_by_a_higher_precedence_one' (85177) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:172:42:
resolves

---- a_pinned_uri_resolves_to_exactly_one_object stdout ----

thread 'a_pinned_uri_resolves_to_exactly_one_object' (85178) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:137:45:
resolves

failures:
    a_named_registry_cannot_be_substituted_by_a_higher_precedence_one
    a_pinned_uri_resolves_to_exactly_one_object

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
