*** crates/rcx-registry-skills/src/uri.rs:239:23: delete ! in uris_for

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ delete ! in uris_for
@@ -231,12 +231,12 @@
 /// Entries with no commit are emitted unpinned: a v1 lockfile can still be browsed,
 /// it just cannot hand out stable identifiers.
 pub fn uris_for(lock: &SkillLock, authority: &str) -> Vec<SkillUri> {
     lock.skills
         .iter()
         .map(|(name, entry)| SkillUri {
             registry: authority.to_string(),
             skill_id: name.clone(),
-            version: (!entry.git_ref.is_empty()).then(|| entry.git_ref.clone()),
+            version: ( /* ~ changed by cargo-mutants ~ */entry.git_ref.is_empty()).then(|| entry.git_ref.clone()),
         })
         .collect()
 }

---- a_v1_lockfile_yields_unpinned_uris stdout ----

thread 'a_v1_lockfile_yields_unpinned_uris' (14501) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:282:5:
assertion failed: !uris[0].is_pinned()

---- uris_for_addresses_every_skill_and_round_trips stdout ----

thread 'uris_for_addresses_every_skill_and_round_trips' (14507) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:267:9:
a v2 lockfile yields stable identifiers

failures:
    a_v1_lockfile_yields_unpinned_uris
    uris_for_addresses_every_skill_and_round_trips

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
