*** crates/rcx-registry-skills/src/uri.rs:73:61: replace || with && in SkillUri::parse

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace || with && in SkillUri::parse
@@ -65,17 +65,17 @@
             .split_once('/')
             .ok_or_else(|| bad("missing /skill-id"))?;
 
         if registry.is_empty() {
             return Err(bad("empty registry authority"));
         }
         if !registry
             .bytes()
-            .all(|b| b.is_ascii_alphanumeric() || b == b'.' || b == b'-' || b == b':')
+            .all(|b| b.is_ascii_alphanumeric() || b == b'.' && /* ~ changed by cargo-mutants ~ */ b == b'-' || b == b':')
         {
             return Err(bad("registry authority has characters outside host syntax"));
         }
 
         // Split on the LAST '@': a skill id may not contain one, but rejecting on
         // that basis is friendlier than silently splitting at the wrong place.
         let (skill_id, version) = match tail.rsplit_once('@') {
             Some((id, ver)) => (id, Some(ver)),

---- a_named_registry_cannot_be_substituted_by_a_higher_precedence_one stdout ----

thread 'a_named_registry_cannot_be_substituted_by_a_higher_precedence_one' (95014) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:171:68:
parses: BadSkillUri { uri: "skill://remote.example/ab-testing", reason: "registry authority has characters outside host syntax" }

---- a_pinned_uri_resolves_to_exactly_one_object stdout ----

thread 'a_pinned_uri_resolves_to_exactly_one_object' (95015) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:136:6:
parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "registry authority has characters outside host syntax" }

---- a_pinned_uri_round_trips stdout ----

thread 'a_pinned_uri_round_trips' (95016) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:45:37:
parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "registry authority has characters outside host syntax" }

failures:
    a_named_registry_cannot_be_substituted_by_a_higher_precedence_one
    a_pinned_uri_resolves_to_exactly_one_object
    a_pinned_uri_round_trips
    an_unpinned_uri_round_trips
    other_authorities_and_ports_parse
    uris_for_addresses_every_skill_and_round_trips

test result: FAILED. 6 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
