*** crates/rcx-registry-skills/src/uri.rs:73:74: replace || with && in SkillUri::parse

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace || with && in SkillUri::parse
@@ -65,17 +65,17 @@
             .split_once('/')
             .ok_or_else(|| bad("missing /skill-id"))?;
 
         if registry.is_empty() {
             return Err(bad("empty registry authority"));
         }
         if !registry
             .bytes()
-            .all(|b| b.is_ascii_alphanumeric() || b == b'.' || b == b'-' || b == b':')
+            .all(|b| b.is_ascii_alphanumeric() || b == b'.' || b == b'-' && /* ~ changed by cargo-mutants ~ */ b == b':')
         {
             return Err(bad("registry authority has characters outside host syntax"));
         }
 
         // Split on the LAST '@': a skill id may not contain one, but rejecting on
         // that basis is friendlier than silently splitting at the wrong place.
         let (skill_id, version) = match tail.rsplit_once('@') {
             Some((id, ver)) => (id, Some(ver)),

---- other_authorities_and_ports_parse stdout ----

thread 'other_authorities_and_ports_parse' (69270) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:73:40:
parses: BadSkillUri { uri: "skill://localhost:8000/my-local-skill", reason: "registry authority has characters outside host syntax" }

failures:
    other_authorities_and_ports_parse

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
