*** crates/rcx-registry-skills/src/uri.rs:90:35: replace || with && in SkillUri::parse

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace || with && in SkillUri::parse
@@ -82,17 +82,17 @@
             None => (tail, None),
         };
 
         if skill_id.is_empty() {
             return Err(bad("empty skill id"));
         }
         // A '/' in the id would make the authority boundary ambiguous, and '..'
         // is a traversal attempt against any store that maps ids onto paths.
-        if skill_id.contains('/') || skill_id.contains("..") {
+        if skill_id.contains('/') && /* ~ changed by cargo-mutants ~ */ skill_id.contains("..") {
             return Err(bad("skill id may not contain '/' or '..'"));
         }
         if skill_id.contains('@') {
             return Err(bad("skill id may not contain '@'"));
         }
 
         let version = match version {
             None => None,

---- malformed_uris_are_refused stdout ----

thread 'malformed_uris_are_refused' (74729) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:116:9:
expected "skill://h/a/b" to be refused

failures:
    malformed_uris_are_refused

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
