*** crates/rcx-registry-skills/src/uri.rs:99:24: replace match guard is_commit_id(v) with false in SkillUri::parse

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace match guard is_commit_id(v) with false in SkillUri::parse
@@ -91,17 +91,17 @@
             return Err(bad("skill id may not contain '/' or '..'"));
         }
         if skill_id.contains('@') {
             return Err(bad("skill id may not contain '@'"));
         }
 
         let version = match version {
             None => None,
-            Some(v) if is_commit_id(v) => Some(v.to_ascii_lowercase()),
+            Some(v) if false /* ~ changed by cargo-mutants ~ */ => Some(v.to_ascii_lowercase()),
             Some(v) if v.is_empty() => return Err(bad("empty version after '@'")),
             Some(_) => {
                 return Err(bad(
                     "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content",
                 ))
             }
         };

---- a_pinned_uri_round_trips stdout ----

thread 'a_pinned_uri_round_trips' (633) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:45:37:
parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content" }

---- a_pinned_uri_resolves_to_exactly_one_object stdout ----

thread 'a_pinned_uri_resolves_to_exactly_one_object' (632) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:136:6:
parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content" }

---- uris_for_addresses_every_skill_and_round_trips stdout ----

thread 'uris_for_addresses_every_skill_and_round_trips' (640) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:269:47:
re-parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content" }

failures:
    a_pinned_uri_resolves_to_exactly_one_object
    a_pinned_uri_round_trips
    uris_for_addresses_every_skill_and_round_trips
    version_case_is_normalised

test result: FAILED. 8 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
