*** crates/rcx-registry-skills/src/fetch.rs:112:25: delete field git_ref from struct LockEntry expression in FetchOutcome::relock

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ delete field git_ref from struct LockEntry expression in FetchOutcome::relock
@@ -104,17 +104,17 @@
             .fetched
             .iter()
             .filter_map(|(name, f)| {
                 let prev = previous.skills.get(name)?;
                 Some((
                     name.clone(),
                     LockEntry {
                         computed_hash: f.digest.clone(),
-                        git_ref: f.git_ref.clone(),
+                         /* ~ changed by cargo-mutants ~ */
                         ..prev.clone()
                     },
                 ))
             })
             .collect();
         // Relocking always writes the current schema: the output carries whatever
         // refs the fetch used, so labelling it v1 would understate it. A relock of
         // an unpinned v1 lockfile still produces refless entries, which `signable`

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (4089) panicked at crates/rcx-registry-skills/src/fetch.rs:363:9:
assertion `left == right` failed: the ref actually fetched is what gets pinned
  left: ""
 right: "1111111111111111111111111111111111111111"

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable

test result: FAILED. 26 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
