*** crates/rcx-registry-skills/src/fetch.rs:222:27: delete ! in parse_commit_sha

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ delete ! in parse_commit_sha
@@ -214,17 +214,17 @@
 /// Split out of the request path so the guard is unit-testable — it is the only
 /// thing standing between a surprising API response and a lockfile pinned to
 /// garbage, and a network-gated test cannot exercise it.
 ///
 /// Normalises case on the way through: GitHub returns lowercase, but an uppercase
 /// id would otherwise reach `signable()` and be rejected far from its cause.
 fn parse_commit_sha(body: &str) -> Option<String> {
     let sha = body.trim();
-    if sha.len() != 40 || !sha.bytes().all(|b| b.is_ascii_hexdigit()) {
+    if sha.len() != 40 ||  /* ~ changed by cargo-mutants ~ */sha.bytes().all(|b| b.is_ascii_hexdigit()) {
         return None;
     }
     Some(sha.to_ascii_lowercase())
 }
 
 /// Check bytes against a pinned digest. Returns the digest actually computed on
 /// failure so the caller can report both sides.
 ///

---- fetch::tests::parse_commit_sha_accepts_a_real_response stdout ----

thread 'fetch::tests::parse_commit_sha_accepts_a_real_response' (15533) panicked at crates/rcx-registry-skills/src/fetch.rs:407:9:
assertion `left == right` failed
  left: None
 right: Some("a1b2c3d4e5f60718293a4b5c6d7e8f9012345678")

---- fetch::tests::parse_commit_sha_rejects_anything_else stdout ----

thread 'fetch::tests::parse_commit_sha_rejects_anything_else' (15534) panicked at crates/rcx-registry-skills/src/fetch.rs:433:13:
assertion `left == right` failed: expected "zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz" to be refused
  left: Some("zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz")
 right: None

failures:
    fetch::tests::parse_commit_sha_accepts_a_real_response
    fetch::tests::parse_commit_sha_rejects_anything_else

test result: FAILED. 25 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
