*** crates/rcx-registry-skills/src/fetch.rs:243:5: replace hex_digest -> String with "xyzzy".into()

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace hex_digest -> String with "xyzzy".into()
@@ -235,23 +235,17 @@
     if actual == expected_hex {
         Ok(())
     } else {
         Err(actual)
     }
 }
 
 fn hex_digest(bytes: &[u8]) -> String {
-    let digest = Sha256::digest(bytes);
-    let mut out = String::with_capacity(64);
-    for byte in digest {
-        use std::fmt::Write as _;
-        let _ = write!(out, "{byte:02x}");
-    }
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Fetch and verify every entry in `lock`.
 ///
 /// One entry failing never aborts the walk — the point of the gate is to *name*
 /// every mismatch, not to stop at the first. Callers decide what an unclean
 /// outcome means.
 pub fn fetch_locked(lock: &SkillLock, client: &reqwest::blocking::Client) -> FetchOutcome {

---- fetch::tests::corrupted_bytes_fail_closed stdout ----

thread 'fetch::tests::corrupted_bytes_fail_closed' (18798) panicked at crates/rcx-registry-skills/src/fetch.rs:317:9:
assertion `left == right` failed
  left: 5
 right: 64

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (18806) panicked at crates/rcx-registry-skills/src/fetch.rs:363:9:
assertion failed: relocked.validate().is_ok()

---- fetch::tests::verifies_matching_bytes stdout ----

thread 'fetch::tests::verifies_matching_bytes' (18809) panicked at crates/rcx-registry-skills/src/fetch.rs:309:9:
assertion failed: verify_bytes(b"hello world", HELLO).is_ok()

failures:
    fetch::tests::corrupted_bytes_fail_closed
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    fetch::tests::verifies_matching_bytes

test result: FAILED. 24 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
