*** crates/rcx-registry-skills/src/fetch.rs:82:9: replace FetchOutcome::verified_count -> usize with 0

*** mutation diff:
--- crates/rcx-registry-skills/src/fetch.rs
+++ replace FetchOutcome::verified_count -> usize with 0
@@ -74,17 +74,17 @@
 
 impl FetchOutcome {
     /// Entries whose bytes matched their pinned digest — the only trusted content.
     pub fn verified(&self) -> impl Iterator<Item = (&String, &Fetched)> {
         self.fetched.iter().filter(|(_, f)| f.matched_lock)
     }
 
     pub fn verified_count(&self) -> usize {
-        self.verified().count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_clean(&self) -> bool {
         self.mismatches.is_empty()
     }
 
     /// Rebuild a lockfile from what was actually fetched, pinning the digests
     /// observed rather than the ones inherited.

---- fetch::tests::verified_count_counts_only_matching_entries stdout ----

thread 'fetch::tests::verified_count_counts_only_matching_entries' (91547) panicked at crates/rcx-registry-skills/src/fetch.rs:456:9:
assertion `left == right` failed: unmatched bytes are never counted as verified
  left: 0
 right: 2

failures:
    fetch::tests::verified_count_counts_only_matching_entries

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
