*** crates/rcx-registry-skills/src/index.rs:71:5: replace tags_of -> Vec<String> with vec![]

*** mutation diff:
--- crates/rcx-registry-skills/src/index.rs
+++ replace tags_of -> Vec<String> with vec![]
@@ -63,27 +63,17 @@
     }
     text
 }
 
 /// Tags from `metadata.tags`, which is where the Agent Skills corpora in the wild
 /// put them. Absent or malformed metadata yields none rather than an error — a
 /// skill without tags is still perfectly indexable.
 fn tags_of(doc: &SkillDocument) -> Vec<String> {
-    doc.front_matter
-        .extra
-        .get("metadata")
-        .and_then(|m| m.get("tags"))
-        .and_then(|t| t.as_sequence())
-        .map(|seq| {
-            seq.iter()
-                .filter_map(|v| v.as_str().map(str::to_string))
-                .collect()
-        })
-        .unwrap_or_default()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build an ingest payload for a set of `(skill_id, document, uri)` triples.
 ///
 /// One chunk per skill: the indexed surface is a couple of hundred characters, so
 /// splitting it would only dilute the term statistics that make BM25 work.
 pub fn ingest_body(
     tenant_id: &str,

---- index::tests::indexed_text_carries_name_description_and_tags stdout ----

thread 'index::tests::indexed_text_carries_name_description_and_tags' (25912) panicked at crates/rcx-registry-skills/src/index.rs:128:9:
tags must reach the index; this term exists in no other field: code-review
Review code for correctness, bugs and security.

---- index::tests::ingest_body_shapes_one_chunk_per_skill stdout ----

thread 'index::tests::ingest_body_shapes_one_chunk_per_skill' (25913) panicked at crates/rcx-registry-skills/src/index.rs:179:9:
tags must reach chunk metadata: {"skill_id":"code-review","license":"Apache-2.0","tags":[]}

failures:
    index::tests::indexed_text_carries_name_description_and_tags
    index::tests::ingest_body_shapes_one_chunk_per_skill

test result: FAILED. 25 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
