*** crates/rcx-registry-skills/src/lock.rs:107:25: replace < with > in SkillLock::signable

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace < with > in SkillLock::signable
@@ -99,17 +99,17 @@
 
     /// Check this lockfile may be signed, or say precisely why not.
     ///
     /// Separate from [`Self::validate`] on purpose: a v1 lockfile is a legitimate
     /// thing to parse, fetch from, and relock. It is only signing that must refuse
     /// it, because a signature over refless entries would look like a guarantee and
     /// carry none.
     pub fn signable(&self) -> Result<(), SkillsError> {
-        if self.version < MIN_SIGNABLE_LOCK_VERSION {
+        if self.version > /* ~ changed by cargo-mutants ~ */ MIN_SIGNABLE_LOCK_VERSION {
             return Err(SkillsError::NotSignable {
                 reason: format!(
                     "lockfile version {} is below the minimum signable version {MIN_SIGNABLE_LOCK_VERSION} (no `ref` field, so a digest mismatch cannot be attributed)",
                     self.version
                 ),
             });
         }
         if self.skills.is_empty() {

---- a_v1_lockfile_cannot_be_signed stdout ----

thread 'a_v1_lockfile_cannot_be_signed' (34750) panicked at crates/rcx-registry-skills/tests/signing.rs:378:13:
got: entry `ab-testing` has ref ""; a full 40-hex commit id is required

failures:
    a_v1_lockfile_cannot_be_signed

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
