*** crates/rcx-registry-skills/src/lock.rs:122:16: delete ! in SkillLock::signable

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ delete ! in SkillLock::signable
@@ -114,17 +114,17 @@
         }
         if self.skills.is_empty() {
             return Err(SkillsError::NotSignable {
                 reason: "refusing to sign an empty lockfile — an empty Merkle root attests nothing"
                     .to_string(),
             });
         }
         for (name, entry) in &self.skills {
-            if !is_git_sha_hex(&entry.git_ref) {
+            if  /* ~ changed by cargo-mutants ~ */is_git_sha_hex(&entry.git_ref) {
                 return Err(SkillsError::NotSignable {
                     reason: format!(
                         "entry `{name}` has ref {:?}; a full 40-hex commit id is required",
                         entry.git_ref
                     ),
                 });
             }
         }

---- fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable stdout ----

thread 'fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable' (15483) panicked at crates/rcx-registry-skills/src/fetch.rs:395:9:
a version bump alone must never make a refless lockfile signable

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (15482) panicked at crates/rcx-registry-skills/src/fetch.rs:371:9:
assertion failed: relocked.signable().is_ok()

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
