*** crates/rcx-registry-skills/src/lock.rs:135:9: replace SkillLock::len -> usize with 0

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace SkillLock::len -> usize with 0
@@ -127,17 +127,17 @@
                     ),
                 });
             }
         }
         Ok(())
     }
 
     pub fn len(&self) -> usize {
-        self.skills.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.skills.is_empty()
     }
 }
 
 /// 64 lowercase hex characters. Uppercase is rejected rather than normalised — two

---- lock::tests::len_and_is_empty_agree stdout ----

thread 'lock::tests::len_and_is_empty_agree' (16100) panicked at crates/rcx-registry-skills/src/lock.rs:242:9:
assertion `left == right` failed
  left: 0
 right: 1

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (16095) panicked at crates/rcx-registry-skills/src/fetch.rs:359:9:
assertion `left == right` failed: unfetchable entries must be dropped
  left: 0
 right: 1

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    lock::tests::len_and_is_empty_agree

test result: FAILED. 21 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
