*** crates/rcx-registry-skills/src/lock.rs:139:9: replace SkillLock::is_empty -> bool with true

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace SkillLock::is_empty -> bool with true
@@ -131,17 +131,17 @@
         Ok(())
     }
 
     pub fn len(&self) -> usize {
         self.skills.len()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.skills.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// 64 lowercase hex characters. Uppercase is rejected rather than normalised — two
 /// spellings of one digest would give the signed snapshot two valid forms.
 fn is_sha256_hex(s: &str) -> bool {
     is_lower_hex(s, 64)
 }

---- lock::tests::len_and_is_empty_agree stdout ----

thread 'lock::tests::len_and_is_empty_agree' (67470) panicked at crates/rcx-registry-skills/src/lock.rs:241:9:
assertion failed: !one.is_empty()

failures:
    lock::tests::len_and_is_empty_agree

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
