*** crates/rcx-registry-skills/src/lock.rs:146:5: replace is_sha256_hex -> bool with true

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace is_sha256_hex -> bool with true
@@ -138,17 +138,17 @@
     pub fn is_empty(&self) -> bool {
         self.skills.is_empty()
     }
 }
 
 /// 64 lowercase hex characters. Uppercase is rejected rather than normalised — two
 /// spellings of one digest would give the signed snapshot two valid forms.
 fn is_sha256_hex(s: &str) -> bool {
-    is_lower_hex(s, 64)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// A full git object id: 40 lowercase hex characters. Abbreviated ids are rejected
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
     is_lower_hex(s, 40)
 }

---- lock::tests::rejects_malformed_hashes stdout ----

thread 'lock::tests::rejects_malformed_hashes' (18563) panicked at crates/rcx-registry-skills/src/lock.rs:219:13:
expected "" to be rejected

failures:
    lock::tests::rejects_malformed_hashes

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
