*** crates/rcx-registry-skills/src/lock.rs:152:5: replace is_git_sha_hex -> bool with false

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace is_git_sha_hex -> bool with false
@@ -144,17 +144,17 @@
 /// spellings of one digest would give the signed snapshot two valid forms.
 fn is_sha256_hex(s: &str) -> bool {
     is_lower_hex(s, 64)
 }
 
 /// A full git object id: 40 lowercase hex characters. Abbreviated ids are rejected
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
-    is_lower_hex(s, 40)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_lower_hex(s: &str, len: usize) -> bool {
     s.len() == len
         && s.bytes()
             .all(|b| b.is_ascii_digit() || (b'a'..=b'f').contains(&b))
 }

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (20450) panicked at crates/rcx-registry-skills/src/fetch.rs:371:9:
assertion failed: relocked.signable().is_ok()

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable

test result: FAILED. 22 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
