*** crates/rcx-registry-skills/src/lock.rs:156:13: replace == with != in is_lower_hex

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace == with != in is_lower_hex
@@ -148,17 +148,17 @@
 
 /// A full git object id: 40 lowercase hex characters. Abbreviated ids are rejected
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
     is_lower_hex(s, 40)
 }
 
 fn is_lower_hex(s: &str, len: usize) -> bool {
-    s.len() == len
+    s.len() != /* ~ changed by cargo-mutants ~ */ len
         && s.bytes()
             .all(|b| b.is_ascii_digit() || (b'a'..=b'f').contains(&b))
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- lock::tests::rejects_malformed_hashes stdout ----

thread 'lock::tests::rejects_malformed_hashes' (46584) panicked at crates/rcx-registry-skills/src/lock.rs:219:13:
expected "" to be rejected

---- lock::tests::round_trip_is_byte_exact stdout ----

thread 'lock::tests::round_trip_is_byte_exact' (46586) panicked at crates/rcx-registry-skills/src/lock.rs:182:47:
parses: BadHash { name: "ab-testing", got: "4ea04d576507f4a683e6203737c33993fb36add719f628b7200649a9cb87b5fe" }

---- lock::tests::rejects_unsupported_source_type stdout ----

thread 'lock::tests::rejects_unsupported_source_type' (46585) panicked at crates/rcx-registry-skills/src/lock.rs:255:9:
assertion failed: matches!(lock.validate(), Err(SkillsError::UnsupportedSource { .. }))

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    fetch::tests::relocking_an_unpinned_lockfile_stays_unsignable
    lock::tests::rejects_malformed_hashes
    lock::tests::rejects_unsupported_source_type
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 22 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
