*** crates/rcx-registry-skills/src/lock.rs:158:41: replace || with && in is_lower_hex

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace || with && in is_lower_hex
@@ -150,17 +150,17 @@
 /// — they are ambiguous by construction, and an ambiguous ref cannot pin content.
 fn is_git_sha_hex(s: &str) -> bool {
     is_lower_hex(s, 40)
 }
 
 fn is_lower_hex(s: &str, len: usize) -> bool {
     s.len() == len
         && s.bytes()
-            .all(|b| b.is_ascii_digit() || (b'a'..=b'f').contains(&b))
+            .all(|b| b.is_ascii_digit() && /* ~ changed by cargo-mutants ~ */ (b'a'..=b'f').contains(&b))
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn entry(hash: &str) -> LockEntry {
         LockEntry {

---- fetch::tests::relock_pins_observed_digests_and_drops_unfetchable stdout ----

thread 'fetch::tests::relock_pins_observed_digests_and_drops_unfetchable' (47408) panicked at crates/rcx-registry-skills/src/fetch.rs:369:9:
assertion failed: relocked.validate().is_ok()

---- lock::tests::round_trip_is_byte_exact stdout ----

thread 'lock::tests::round_trip_is_byte_exact' (47420) panicked at crates/rcx-registry-skills/src/lock.rs:182:47:
parses: BadHash { name: "ab-testing", got: "4ea04d576507f4a683e6203737c33993fb36add719f628b7200649a9cb87b5fe" }

---- lock::tests::rejects_unsupported_source_type stdout ----

thread 'lock::tests::rejects_unsupported_source_type' (47419) panicked at crates/rcx-registry-skills/src/lock.rs:255:9:
assertion failed: matches!(lock.validate(), Err(SkillsError::UnsupportedSource { .. }))

failures:
    fetch::tests::relock_pins_observed_digests_and_drops_unfetchable
    lock::tests::rejects_unsupported_source_type
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 24 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
