*** crates/rcx-registry-skills/src/lock.rs:77:9: replace SkillLock::to_json -> Result<String, SkillsError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/rcx-registry-skills/src/lock.rs
+++ replace SkillLock::to_json -> Result<String, SkillsError> with Ok("xyzzy".into())
@@ -69,19 +69,17 @@
         let lock: Self = serde_json::from_str(raw)?;
         lock.validate()?;
         Ok(lock)
     }
 
     /// Serialise in the canonical on-disk form: 2-space indent, sorted keys,
     /// trailing newline.
     pub fn to_json(&self) -> Result<String, SkillsError> {
-        let mut out = serde_json::to_string_pretty(self)?;
-        out.push('\n');
-        Ok(out)
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn validate(&self) -> Result<(), SkillsError> {
         for (name, entry) in &self.skills {
             if !is_sha256_hex(&entry.computed_hash) {
                 return Err(SkillsError::BadHash {
                     name: name.clone(),
                     got: entry.computed_hash.clone(),

---- lock::tests::keys_serialise_sorted_regardless_of_insertion_order stdout ----

thread 'lock::tests::keys_serialise_sorted_regardless_of_insertion_order' (29348) panicked at crates/rcx-registry-skills/src/lock.rs:196:40:
Alpha present

---- lock::tests::round_trip_is_byte_exact stdout ----

thread 'lock::tests::round_trip_is_byte_exact' (29353) panicked at crates/rcx-registry-skills/src/lock.rs:181:9:
assertion `left == right` failed
  left: "xyzzy"

failures:
    lock::tests::keys_serialise_sorted_regardless_of_insertion_order
    lock::tests::round_trip_is_byte_exact

test result: FAILED. 25 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
