*** crates/rcx-registry-skills/src/sign.rs:60:5: replace lock_merkle_root -> Result<[u8; HASH_LEN], SkillsError> with Ok([0; HASH_LEN])

*** mutation diff:
--- crates/rcx-registry-skills/src/sign.rs
+++ replace lock_merkle_root -> Result<[u8; HASH_LEN], SkillsError> with Ok([0; HASH_LEN])
@@ -52,18 +52,17 @@
         .collect()
 }
 
 /// Merkle root over a lockfile.
 ///
 /// Refuses unsignable lockfiles rather than returning a root nobody should use —
 /// a root is only meaningful if the entries under it can be re-derived.
 pub fn lock_merkle_root(lock: &SkillLock) -> Result<[u8; HASH_LEN], SkillsError> {
-    lock.signable()?;
-    Ok(snapshot_merkle_root(&digest_entries(lock)))
+    Ok([0; HASH_LEN]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Everything about a receipt except the signature, which the caller's signer
 /// produces. Identifiers are caller-supplied so the reproducible part of the
 /// receipt stays reproducible.
 pub struct ReceiptDraft {
     pub event_id: [u8; 16],
     pub snapshot_id: [u8; 16],

---- a_v1_lockfile_cannot_be_signed stdout ----

thread 'a_v1_lockfile_cannot_be_signed' (75997) panicked at crates/rcx-registry-skills/tests/signing.rs:385:5:
no root for an unsignable lockfile

---- every_identifying_field_changes_the_root stdout ----

thread 'every_identifying_field_changes_the_root' (76002) panicked at crates/rcx-registry-skills/tests/signing.rs:250:9:
assertion `left != right` failed: changing source must move the Merkle root
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

---- a_flipped_content_hash_fails_verification stdout ----

thread 'a_flipped_content_hash_fails_verification' (75992) panicked at crates/rcx-registry-skills/tests/signing.rs:280:5:
a single flipped byte in any computedHash must fail verification

failures:
    a_flipped_content_hash_fails_verification
    a_v1_lockfile_cannot_be_signed
    a_validly_signed_receipt_for_another_lockfile_is_rejected
    every_identifying_field_changes_the_root

test result: FAILED. 14 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
