*** crates/rcx-registry-skills/src/skill.rs:74:9: replace SkillDocument::discovery_description -> &str with "xyzzy"

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace SkillDocument::discovery_description -> &str with "xyzzy"
@@ -66,21 +66,17 @@
     }
 
     /// Description as agents see it at discovery time.
     ///
     /// Claude Code truncates each description to 250 characters in its skill index
     /// and caps the whole index at 1% of the context window, so a long description
     /// does not merely get cut — it crowds out other skills' descriptions too.
     pub fn discovery_description(&self, limit: usize) -> &str {
-        let d = &self.front_matter.description;
-        match d.char_indices().nth(limit) {
-            Some((byte_idx, _)) => &d[..byte_idx],
-            None => d,
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
     let mut offset = 0usize;
     for line in rest.split_inclusive('\n') {
         if line.trim_end_matches('\n') == FENCE {

---- skill::tests::discovery_description_truncates_on_char_boundaries stdout ----

thread 'skill::tests::discovery_description_truncates_on_char_boundaries' (58551) panicked at crates/rcx-registry-skills/src/skill.rs:146:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "ünïcödé description that runs long"

failures:
    skill::tests::discovery_description_truncates_on_char_boundaries

test result: FAILED. 26 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
