*** crates/rcx-registry-skills/src/skill.rs:84:5: replace split_at_closing_fence -> Option<(&str, &str)> with Some(("", "xyzzy"))

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace split_at_closing_fence -> Option<(&str, &str)> with Some(("", "xyzzy"))
@@ -76,24 +76,17 @@
             Some((byte_idx, _)) => &d[..byte_idx],
             None => d,
         }
     }
 }
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
-    let mut offset = 0usize;
-    for line in rest.split_inclusive('\n') {
-        if line.trim_end_matches('\n') == FENCE {
-            return Some((&rest[..offset], &rest[offset + line.len()..]));
-        }
-        offset += line.len();
-    }
-    None
+    Some(("", "xyzzy")) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     const DOC: &str = "---\nname: ab-testing\ndescription: \"Run an A/B test: design, size, read out.\"\nversion: \"1.2\"\ntags:\n  - growth\n---\n\n# A/B testing\n\nBody here.\n";

---- skill::tests::parses_frontmatter_and_body stdout ----

thread 'skill::tests::parses_frontmatter_and_body' (85897) panicked at crates/rcx-registry-skills/src/skill.rs:95:43:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

---- skill::tests::frontmatter_ending_at_eof_still_parses stdout ----

thread 'skill::tests::frontmatter_ending_at_eof_still_parses' (85896) panicked at crates/rcx-registry-skills/src/skill.rs:120:75:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

---- skill::tests::preserves_unmodelled_keys stdout ----

thread 'skill::tests::preserves_unmodelled_keys' (85898) panicked at crates/rcx-registry-skills/src/skill.rs:104:43:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

failures:
    skill::tests::accepts_bom_and_crlf
    skill::tests::discovery_description_truncates_on_char_boundaries
    skill::tests::frontmatter_ending_at_eof_still_parses
    skill::tests::parses_frontmatter_and_body
    skill::tests::preserves_unmodelled_keys
    skill::tests::rejects_missing_and_unterminated_frontmatter

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
