*** crates/rcx-registry-skills/src/skill.rs:86:40: replace == with != in split_at_closing_fence

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace == with != in split_at_closing_fence
@@ -78,17 +78,17 @@
         }
     }
 }
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
     let mut offset = 0usize;
     for line in rest.split_inclusive('\n') {
-        if line.trim_end_matches('\n') == FENCE {
+        if line.trim_end_matches('\n') != /* ~ changed by cargo-mutants ~ */ FENCE {
             return Some((&rest[..offset], &rest[offset + line.len()..]));
         }
         offset += line.len();
     }
     None
 }
 
 #[cfg(test)]

---- skill::tests::preserves_unmodelled_keys stdout ----

thread 'skill::tests::preserves_unmodelled_keys' (87909) panicked at crates/rcx-registry-skills/src/skill.rs:111:43:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

---- skill::tests::discovery_description_truncates_on_char_boundaries stdout ----

thread 'skill::tests::discovery_description_truncates_on_char_boundaries' (87906) panicked at crates/rcx-registry-skills/src/skill.rs:147:43:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

---- skill::tests::accepts_bom_and_crlf stdout ----

thread 'skill::tests::accepts_bom_and_crlf' (87905) panicked at crates/rcx-registry-skills/src/skill.rs:121:48:
parses: Yaml(Error("missing field `name`", line: 1, column: 1))

failures:
    skill::tests::accepts_bom_and_crlf
    skill::tests::discovery_description_truncates_on_char_boundaries
    skill::tests::frontmatter_ending_at_eof_still_parses
    skill::tests::parses_frontmatter_and_body
    skill::tests::preserves_unmodelled_keys
    skill::tests::rejects_missing_and_unterminated_frontmatter

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
