*** crates/rcx-registry-skills/src/skill.rs:87:56: replace + with - in split_at_closing_fence

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace + with - in split_at_closing_fence
@@ -79,17 +79,17 @@
     }
 }
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
     let mut offset = 0usize;
     for line in rest.split_inclusive('\n') {
         if line.trim_end_matches('\n') == FENCE {
-            return Some((&rest[..offset], &rest[offset + line.len()..]));
+            return Some((&rest[..offset], &rest[offset - /* ~ changed by cargo-mutants ~ */ line.len()..]));
         }
         offset += line.len();
     }
     None
 }
 
 #[cfg(test)]
 mod tests {

---- skill::tests::frontmatter_ending_at_eof_still_parses stdout ----

thread 'skill::tests::frontmatter_ending_at_eof_still_parses' (64405) panicked at crates/rcx-registry-skills/src/skill.rs:129:9:
assertion `left == right` failed
  left: " d\n---"
 right: ""

---- skill::tests::parses_frontmatter_and_body stdout ----

thread 'skill::tests::parses_frontmatter_and_body' (64406) panicked at crates/rcx-registry-skills/src/skill.rs:106:9:
assertion failed: d.body.starts_with("# A/B testing")

failures:
    skill::tests::frontmatter_ending_at_eof_still_parses
    skill::tests::parses_frontmatter_and_body

test result: FAILED. 25 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
