*** crates/rcx-registry-skills/src/skill.rs:89:16: replace += with -= in split_at_closing_fence

*** mutation diff:
--- crates/rcx-registry-skills/src/skill.rs
+++ replace += with -= in split_at_closing_fence
@@ -81,17 +81,17 @@
 
 /// Split frontmatter from body at the first line that is exactly `---`.
 fn split_at_closing_fence(rest: &str) -> Option<(&str, &str)> {
     let mut offset = 0usize;
     for line in rest.split_inclusive('\n') {
         if line.trim_end_matches('\n') == FENCE {
             return Some((&rest[..offset], &rest[offset + line.len()..]));
         }
-        offset += line.len();
+        offset -= /* ~ changed by cargo-mutants ~ */ line.len();
     }
     None
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- skill::tests::discovery_description_truncates_on_char_boundaries stdout ----

thread 'skill::tests::discovery_description_truncates_on_char_boundaries' (90047) panicked at crates/rcx-registry-skills/src/skill.rs:89:9:
attempt to subtract with overflow

---- skill::tests::preserves_unmodelled_keys stdout ----

thread 'skill::tests::preserves_unmodelled_keys' (90050) panicked at crates/rcx-registry-skills/src/skill.rs:89:9:
attempt to subtract with overflow

---- skill::tests::accepts_bom_and_crlf stdout ----

thread 'skill::tests::accepts_bom_and_crlf' (90046) panicked at crates/rcx-registry-skills/src/skill.rs:89:9:
attempt to subtract with overflow

failures:
    skill::tests::accepts_bom_and_crlf
    skill::tests::discovery_description_truncates_on_char_boundaries
    skill::tests::frontmatter_ending_at_eof_still_parses
    skill::tests::parses_frontmatter_and_body
    skill::tests::preserves_unmodelled_keys
    skill::tests::rejects_missing_and_unterminated_frontmatter

test result: FAILED. 17 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
