*** crates/rcx-registry-skills/src/uri.rs:103:24: replace match guard is_commit_id(v) with true in SkillUri::parse

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace match guard is_commit_id(v) with true in SkillUri::parse
@@ -95,17 +95,17 @@
         }
 
         let version = match version {
             None => None,
             // Literal pattern rather than a guard: `""` fails `is_commit_id` anyway,
             // so a guard here reads as redundant, but the distinct message is worth
             // keeping — "empty version" and "not a commit id" are different mistakes.
             Some("") => return Err(bad("empty version after '@'")),
-            Some(v) if is_commit_id(v) => Some(v.to_ascii_lowercase()),
+            Some(v) if true /* ~ changed by cargo-mutants ~ */ => Some(v.to_ascii_lowercase()),
             Some(_) => {
                 return Err(bad(
                     "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content",
                 ))
             }
         };
 
         Ok(Self {

---- a_mutable_version_is_refused stdout ----

thread 'a_mutable_version_is_refused' (75075) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:95:9:
expected skill://h/x@v1.2 to be refused

failures:
    a_mutable_version_is_refused

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
