*** crates/rcx-registry-skills/src/uri.rs:120:9: replace SkillUri::is_pinned -> bool with true

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace SkillUri::is_pinned -> bool with true
@@ -112,17 +112,17 @@
             registry: registry.to_string(),
             skill_id: skill_id.to_string(),
             version,
         })
     }
 
     /// True when this URI names an immutable object.
     pub fn is_pinned(&self) -> bool {
-        self.version.is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pin an unpinned URI to a commit.
     pub fn pinned_to(&self, commit: &str) -> Self {
         Self {
             version: Some(commit.to_ascii_lowercase()),
             ..self.clone()
         }

---- a_v1_lockfile_yields_unpinned_uris stdout ----

thread 'a_v1_lockfile_yields_unpinned_uris' (99137) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:282:5:
assertion failed: !uris[0].is_pinned()

---- an_unpinned_uri_round_trips stdout ----

thread 'an_unpinned_uri_round_trips' (99139) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:61:5:
assertion failed: !uri.is_pinned()

failures:
    a_v1_lockfile_yields_unpinned_uris
    an_unpinned_uri_round_trips

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
