*** crates/rcx-registry-skills/src/uri.rs:120:9: replace SkillUri::is_pinned -> bool with false

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace SkillUri::is_pinned -> bool with false
@@ -112,17 +112,17 @@
             registry: registry.to_string(),
             skill_id: skill_id.to_string(),
             version,
         })
     }
 
     /// True when this URI names an immutable object.
     pub fn is_pinned(&self) -> bool {
-        self.version.is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pin an unpinned URI to a commit.
     pub fn pinned_to(&self, commit: &str) -> Self {
         Self {
             version: Some(commit.to_ascii_lowercase()),
             ..self.clone()
         }

---- a_pinned_uri_round_trips stdout ----

thread 'a_pinned_uri_round_trips' (77692) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:49:5:
assertion failed: uri.is_pinned()

---- uris_for_addresses_every_skill_and_round_trips stdout ----

thread 'uris_for_addresses_every_skill_and_round_trips' (77699) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:267:9:
a v2 lockfile yields stable identifiers

---- search_precedence_is_local_then_trusted_then_public stdout ----

thread 'search_precedence_is_local_then_trusted_then_public' (77698) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:239:5:
assertion failed: hit.uri.is_pinned()

failures:
    a_pinned_uri_round_trips
    search_precedence_is_local_then_trusted_then_public
    uris_for_addresses_every_skill_and_round_trips

test result: FAILED. 9 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
