*** crates/rcx-registry-skills/src/uri.rs:134:9: replace <impl fmt::Display for SkillUri>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace <impl fmt::Display for SkillUri>::fmt -> fmt::Result with Ok(Default::default())
@@ -126,21 +126,17 @@
             version: Some(commit.to_ascii_lowercase()),
             ..self.clone()
         }
     }
 }
 
 impl fmt::Display for SkillUri {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write!(f, "{SCHEME}{}/{}", self.registry, self.skill_id)?;
-        if let Some(version) = &self.version {
-            write!(f, "@{version}")?;
-        }
-        Ok(())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn is_commit_id(s: &str) -> bool {
     s.len() == 40 && s.bytes().all(|b| b.is_ascii_hexdigit())
 }
 
 /// How much a registry is trusted, which is also its search precedence.

---- an_unpinned_uri_round_trips stdout ----

thread 'an_unpinned_uri_round_trips' (1788) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:62:5:
assertion `left == right` failed
  left: ""
 right: "skill://registry.rcxprotocol.org/ab-testing"

---- search_precedence_is_local_then_trusted_then_public stdout ----

thread 'search_precedence_is_local_then_trusted_then_public' (1791) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:240:5:
assertion `left == right` failed
  left: ""
 right: "skill://local.example/shared@0fedcba98765432100112233445566778899aabb"

---- a_pinned_uri_round_trips stdout ----

thread 'a_pinned_uri_round_trips' (1785) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:50:5:
assertion `left == right` failed: render must reproduce the input exactly
  left: ""
 right: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678"

failures:
    a_pinned_uri_round_trips
    an_unpinned_uri_round_trips
    other_authorities_and_ports_parse
    search_precedence_is_local_then_trusted_then_public
    uris_for_addresses_every_skill_and_round_trips

test result: FAILED. 7 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
