*** crates/rcx-registry-skills/src/uri.rs:143:5: replace is_commit_id -> bool with true

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace is_commit_id -> bool with true
@@ -135,17 +135,17 @@
         if let Some(version) = &self.version {
             write!(f, "@{version}")?;
         }
         Ok(())
     }
 }
 
 fn is_commit_id(s: &str) -> bool {
-    s.len() == 40 && s.bytes().all(|b| b.is_ascii_hexdigit())
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// How much a registry is trusted, which is also its search precedence.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, PartialOrd, Ord)]
 pub enum RegistryKind {
     /// This node's own lockfile. Always answered first — a local pin must never be
     /// silently overridden by a remote answer.
     Local,

---- a_mutable_version_is_refused stdout ----

thread 'a_mutable_version_is_refused' (80311) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:95:9:
expected skill://h/x@v1.2 to be refused

failures:
    a_mutable_version_is_refused

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
