*** crates/rcx-registry-skills/src/uri.rs:143:5: replace is_commit_id -> bool with false

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace is_commit_id -> bool with false
@@ -135,17 +135,17 @@
         if let Some(version) = &self.version {
             write!(f, "@{version}")?;
         }
         Ok(())
     }
 }
 
 fn is_commit_id(s: &str) -> bool {
-    s.len() == 40 && s.bytes().all(|b| b.is_ascii_hexdigit())
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// How much a registry is trusted, which is also its search precedence.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, PartialOrd, Ord)]
 pub enum RegistryKind {
     /// This node's own lockfile. Always answered first — a local pin must never be
     /// silently overridden by a remote answer.
     Local,

---- a_pinned_uri_resolves_to_exactly_one_object stdout ----

thread 'a_pinned_uri_resolves_to_exactly_one_object' (3239) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:136:6:
parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content" }

---- a_pinned_uri_round_trips stdout ----

thread 'a_pinned_uri_round_trips' (3240) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:45:37:
parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content" }

---- uris_for_addresses_every_skill_and_round_trips stdout ----

thread 'uris_for_addresses_every_skill_and_round_trips' (3247) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:269:47:
re-parses: BadSkillUri { uri: "skill://registry.rcxprotocol.org/ab-testing@a1b2c3d4e5f60718293a4b5c6d7e8f9012345678", reason: "version must be a full 40-hex commit id — a mutable tag or semver cannot pin content" }

failures:
    a_pinned_uri_resolves_to_exactly_one_object
    a_pinned_uri_round_trips
    uris_for_addresses_every_skill_and_round_trips
    version_case_is_normalised

test result: FAILED. 8 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
