*** crates/rcx-registry-skills/src/uri.rs:179:5: replace resolution_order -> Vec<&Registry> with vec![]

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace resolution_order -> Vec<&Registry> with vec![]
@@ -171,19 +171,17 @@
     pub entry: &'a LockEntry,
 }
 
 /// Search precedence: local, then trusted remotes in configured order, then public.
 ///
 /// Stable within a kind, so the operator's configured order is preserved rather
 /// than re-sorted by host name.
 pub fn resolution_order(registries: &[Registry]) -> Vec<&Registry> {
-    let mut ordered: Vec<&Registry> = registries.iter().collect();
-    ordered.sort_by_key(|r| r.kind);
-    ordered
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Resolve a `skill://` URI against a federation.
 ///
 /// The URI names its registry, so precedence does not apply — only the named
 /// registry may answer. Anything else would let a higher-precedence registry
 /// substitute content for a URI that explicitly asked elsewhere, which is the
 /// substitution attack the scheme exists to prevent.

---- search_precedence_is_local_then_trusted_then_public stdout ----

thread 'search_precedence_is_local_then_trusted_then_public' (5433) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:220:5:
assertion `left == right` failed
  left: []
 right: ["local.example", "trusted-b.example", "trusted-a.example", "public.example"]

failures:
    search_precedence_is_local_then_trusted_then_public

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
