*** crates/rcx-registry-skills/src/uri.rs:197:27: replace != with == in resolve

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace != with == in resolve
@@ -189,17 +189,17 @@
 /// substitution attack the scheme exists to prevent.
 ///
 /// A pinned URI additionally requires the entry's commit to match. A registry that
 /// holds the skill at a *different* commit is not a match — it is a different object.
 pub fn resolve<'a>(uri: &SkillUri, registries: &'a [Registry]) -> Option<Resolved<'a>> {
     let registry = registries.iter().find(|r| r.host == uri.registry)?;
     let entry = registry.lock.skills.get(&uri.skill_id)?;
     if let Some(version) = &uri.version {
-        if &entry.git_ref != version {
+        if &entry.git_ref == /* ~ changed by cargo-mutants ~ */ version {
             return None;
         }
     }
     Some(Resolved {
         uri: uri.clone(),
         registry: &registry.host,
         kind: registry.kind,
         entry,

---- a_pinned_uri_resolves_to_exactly_one_object stdout ----

thread 'a_pinned_uri_resolves_to_exactly_one_object' (86402) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:137:45:
resolves

failures:
    a_pinned_uri_resolves_to_exactly_one_object

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
