*** crates/rcx-registry-skills/src/uri.rs:214:5: replace resolve_by_id -> Option<Resolved<'a>> with None

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace resolve_by_id -> Option<Resolved<'a>> with None
@@ -206,32 +206,17 @@
     })
 }
 
 /// Resolve a bare skill id with no registry named, honouring precedence.
 ///
 /// This is the search path — `skills_find_relevant` rather than a URI lookup — and
 /// it is where [`resolution_order`] matters.
 pub fn resolve_by_id<'a>(skill_id: &str, registries: &'a [Registry]) -> Option<Resolved<'a>> {
-    for registry in resolution_order(registries) {
-        if let Some(entry) = registry.lock.skills.get(skill_id) {
-            let uri = SkillUri {
-                registry: registry.host.clone(),
-                skill_id: skill_id.to_string(),
-                version: (!entry.git_ref.is_empty()).then(|| entry.git_ref.clone()),
-            };
-            return Some(Resolved {
-                uri,
-                registry: &registry.host,
-                kind: registry.kind,
-                entry,
-            });
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Every skill in `lock`, addressed under `authority`.
 ///
 /// Entries with no commit are emitted unpinned: a v1 lockfile can still be browsed,
 /// it just cannot hand out stable identifiers.
 pub fn uris_for(lock: &SkillLock, authority: &str) -> Vec<SkillUri> {
     lock.skills

---- search_precedence_is_local_then_trusted_then_public stdout ----

thread 'search_precedence_is_local_then_trusted_then_public' (87272) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:231:52:
resolves

failures:
    search_precedence_is_local_then_trusted_then_public

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
