*** crates/rcx-registry-skills/src/uri.rs:219:27: delete ! in resolve_by_id

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ delete ! in resolve_by_id
@@ -211,17 +211,17 @@
 /// This is the search path — `skills_find_relevant` rather than a URI lookup — and
 /// it is where [`resolution_order`] matters.
 pub fn resolve_by_id<'a>(skill_id: &str, registries: &'a [Registry]) -> Option<Resolved<'a>> {
     for registry in resolution_order(registries) {
         if let Some(entry) = registry.lock.skills.get(skill_id) {
             let uri = SkillUri {
                 registry: registry.host.clone(),
                 skill_id: skill_id.to_string(),
-                version: (!entry.git_ref.is_empty()).then(|| entry.git_ref.clone()),
+                version: ( /* ~ changed by cargo-mutants ~ */entry.git_ref.is_empty()).then(|| entry.git_ref.clone()),
             };
             return Some(Resolved {
                 uri,
                 registry: &registry.host,
                 kind: registry.kind,
                 entry,
             });
         }

---- search_precedence_is_local_then_trusted_then_public stdout ----

thread 'search_precedence_is_local_then_trusted_then_public' (9355) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:239:5:
assertion failed: hit.uri.is_pinned()

failures:
    search_precedence_is_local_then_trusted_then_public

test result: FAILED. 11 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
