*** crates/rcx-registry-skills/src/uri.rs:237:5: replace uris_for -> Vec<SkillUri> with vec![]

*** mutation diff:
--- crates/rcx-registry-skills/src/uri.rs
+++ replace uris_for -> Vec<SkillUri> with vec![]
@@ -229,17 +229,10 @@
     None
 }
 
 /// Every skill in `lock`, addressed under `authority`.
 ///
 /// Entries with no commit are emitted unpinned: a v1 lockfile can still be browsed,
 /// it just cannot hand out stable identifiers.
 pub fn uris_for(lock: &SkillLock, authority: &str) -> Vec<SkillUri> {
-    lock.skills
-        .iter()
-        .map(|(name, entry)| SkillUri {
-            registry: authority.to_string(),
-            skill_id: name.clone(),
-            version: (!entry.git_ref.is_empty()).then(|| entry.git_ref.clone()),
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }

---- a_v1_lockfile_yields_unpinned_uris stdout ----

thread 'a_v1_lockfile_yields_unpinned_uris' (89095) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:282:18:
index out of bounds: the len is 0 but the index is 0

---- uris_for_addresses_every_skill_and_round_trips stdout ----

thread 'uris_for_addresses_every_skill_and_round_trips' (89101) panicked at crates/rcx-registry-skills/tests/skill_uri.rs:265:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    a_v1_lockfile_yields_unpinned_uris
    uris_for_addresses_every_skill_and_round_trips

test result: FAILED. 10 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
